# 2.Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#
# Пример:
#
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]



lst = [20, 3, 55, 6, 90, 10]
new_lst = lst[::-1]
print(new_lst)
print(lst)
i = 0
while i <= len(lst) // 2:
    mult = lst[i] * new_lst[i]
    i += 1
    print(mult)
